# install packages
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "ctags"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "k9s"
brew "kubernetes-cli", link: false
brew "mercurial"
brew "neofetch"
brew "neovim"
brew "openssl@3"
brew "paperkey"
brew "protobuf"
brew "pyenv"
brew "qrencode"
brew "terraform"
brew "tree"
brew "wget"
brew "zstd"

cask "font-fira-code"
cask "docker"
cask "monitorcontrol"
cask "raindropio"
cask "alfred"
cask "sourcetree"
cask "macdown"
cask "istat-menus"
cask "insomnia"
cask "firefox"
cask "discord"
cask "tableplus"
cask "visual-studio-code"
cask "1password"
cask "appcleaner"
cask "iterm2"
cask "muzzle"
cask "the-unarchiver"
cask "google-chrome"
cask "aldente"
cask "choosy"
cask "bartender"
cask "itsycal"
cask "launchcontrol"
cask "spaceid"
cask "kdiff3"