# install packages
# created using: brew bundle dump
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "txn2/tap"

brew "ctags"
#brew "fish"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "jq"
brew "k9s"
# brew "minikube"
# brew "kubernetes-cli", link: false
brew "lazydocker"
brew "neofetch"
# brew "neovim"
brew "openssl@3"
brew "paperkey"
brew "protobuf"
brew "pyenv"
brew "qrencode"
brew "terraform"
brew "tree"
brew "wget"
brew "zstd"
brew "exa"
brew "rust"
brew "rustup-init"
brew "go-task"


cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
#cask "docker"
cask "monitorcontrol"
cask "raindropio"
cask "alfred"
cask "sourcetree"
cask "macdown"
cask "istat-menus"
cask "insomnia"
cask "firefox"
cask "discord"
cask "tableplus"
cask "visual-studio-code"
cask "sublime-text"
cask "1password"
cask "appcleaner"
cask "iterm2"
cask "rectangle"
cask "muzzle"
cask "the-unarchiver"
cask "google-chrome"
# cask "aldente"
# cask "choosy"
# cask "bartender"
cask "itsycal"
# cask "launchcontrol"
# cask "spaceid"
cask "kdiff3"
cask "infra"
cask "warp"